JoeSc/FreeRTOS_LPC1114/FreeRTOSConfig.h
#ifndef FREERTOS_CONFIG_H
#define FREERTOS_CONFIG_H

/* Here is a good place to include header files that are required across
your application. */
#include "lpc111x.h"

#define configUSE_PREEMPTION                1
#define configUSE_IDLE_HOOK                 1
#define configUSE_TICK_HOOK                 0
#define configCPU_CLOCK_HZ                  48000000 //SystemCoreClock
#define configTICK_RATE_HZ                  1000
#define configMAX_PRIORITIES                5
#define tskIDLE_STACK_SIZE                  24
#define configMINIMAL_STACK_SIZE            128/* This value is in words (memory usage is n*4 bytes) */
#define configTOTAL_HEAP_SIZE               4000 /* This value is in bytes */
#define configMAX_TASK_NAME_LEN             8
#define configUSE_TRACE_FACILITY            1
#define configUSE_16_BIT_TICKS              0
#define configIDLE_SHOULD_YIELD             1
#define configUSE_MUTEXES                   0
#define configUSE_RECURSIVE_MUTEXES         0
#define configUSE_COUNTING_SEMAPHORES       0
#define configUSE_ALTERNATIVE_API           0
#define configCHECK_FOR_STACK_OVERFLOW      2
#define configQUEUE_REGISTRY_SIZE           10
#define configGENERATE_RUN_TIME_STATS       0

#define INCLUDE_vTaskPrioritySet            1
#define INCLUDE_uxTaskPriorityGet           1
#define INCLUDE_vTaskDelete                 1
#define INCLUDE_vTaskCleanUpResources       0
#define INCLUDE_vTaskSuspend                1
#define INCLUDE_vResumeFromISR              1
#define INCLUDE_vTaskDelayUntil             1
#define INCLUDE_vTaskDelay                  1
#define INCLUDE_xTaskGetSchedulerState      1
#define INCLUDE_xTaskGetCurrentTaskHandle   1
#define INCLUDE_uxTaskGetStackHighWaterMark 1

#define configUSE_CO_ROUTINES               0
#define configMAX_CO_ROUTINE_PRIORITIES     1

#define configKERNEL_INTERRUPT_PRIORITY			0 /* [dependent of processor] */
#define configMAX_SYSCALL_INTERRUPT_PRIORITY	0 /* [dependent on processor and application] */
/*Custom Defines after HERE*/
#define INCLUDE_vPortUsedMem                1
#endif /* FREERTOS_CONFIG_H */
